# BoundaryYRotationFixed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BoundaryYRotationFixed Property
ParameterTypeId Class See Also
---
"Y Rotation - Fixed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BoundaryYRotationFixed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BoundaryYRotationFixed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BoundaryYRotationFixed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace